[{"jobID": "0a686ed58c5278a3", "jobTitle": "Senior Data Architect - NDA", "employer": "OCI Inc.", "location": "Toronto, ON", "url": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DYT_hD0Z6PO7xdFqyaZvh-BBwG9aj_lC6SXTHb_Nj5ZrS8HW3pFCq5TSf67a4xlQa5bpfRJi-8h6eJeGu2E2QWFyWWf_ETb0qHK7KLgecMiuCl-b5VdG8Q7te2slYDoCJRXbpRlZ1cymRIiAJJQDuQapjv0Wq6PNF3YUvCIsZ5kza3RKxVzXHVrzaZNd4kUnGClpcVxnvHO9mQyRF4JpgKcvEQlNrpyx89tyENOhBbf2xia5S2RUyKQ8Xx4mPHAcfQsCBbs-VO4s0EKvZCeRXZlwi_6yxMS2lMiIhwB-n-QpN9dpozI3bp6C7lTud1j-EZ2F4iIZxp8ydVEHToanvnuMPV73GcWTqESwwCRVt9JoRUnMyHSTJ5wv3o3pKgjIOo_734JZ1GKI86YcUyGRiAULlWG9WhyFsvSeRFn2nvoUoF1AvFkWsSYAD1O3E-HGk1ziz6g5WVqA==&p=0&fvj=1&vjs=3", "jobDescription": "Location:  Edmonton, AB / Remote during Covid-19 restriction.Start Date:  Sep 21, 2020 (Some flexibility in Start date).Duration:  Six (6) months initial Contract; extendable for 18 additional months.Project/Position Summary: We are seeking up to Two (2) Senior Data Architect experienced in designing and implementing Enterprise Data Warehouse with slowly changing dimensions; Work with the business to discover the initial subject areas to be included in the data warehouse; Conceptual Design of the Data Warehouse; Dimensional modeling; Data Orchestration; ETL process mapping; Metadata documentation; Data cleansing; and Training and support to transition the maintenance of the data warehouse to the internal team.Responsibilities/Deliverables: The Sr. Data Architect responsibilities/deliverables will include, but may not be limited to:a. Design and implementation of an SCD2 Enterprise Data Warehouse;b. Work with the business to discover the initial subject areas to be included in the data warehouse;c. Conceptual Design of the Data Warehouse;d. Dimensional modeling;e. Data Orchestration;f. ETL process mapping;g. Metadata documentation;h. Data cleansing;i. Training and support to transition the maintenance of the data warehouse to the internal team.j. Provide Bi-weekly written status reports shall be submitted to the Department Project ManagerExperience/Skills Requirements: The Sr. Data Architect should have the following qualifications, skills and experience:1. Degree, Diploma or Certificate with equivalent experience in related field;2. Minimum 5+ years design and implementation of Enterprise Data Warehouse;3. Ability to work with the business to discover the initial subject areas to be included in the data warehouse;4. Experience in Conceptual Design of the Data Warehouse;5. Experience in dimensional modeling;6. Experience in Data Orchestration;7. Experience in ETL process mapping;8. Experience in Metadata documentation;9. Experience Data cleansing;5. Experience in training and support to transition the maintenance of the data warehouse to the internal team.How to Apply: We truly thank all applicants for their interest, however only those shortlisted will be contacted for this role (SDA-200852). We will retain your resume for other current or upcoming relevant roles. Our best wishes.Please send your updated MS Word resume through Indeed.ca easy apply or to ocihr@myoci .ca quoting “Sr. Data Architect -NDA” and include:· Availability:· Work location desired:· Rate expectation:OCI Inc. is Canadian based Information Technology (IT) Service Company headquartered in Toronto, with offices across Western Provinces. We have been successfully working with the private and public sector in Canada, USA and globally since 1998. To avoid redundant work, we no longer post new jobs at our website www.myoci.caReference ID: SDA-200852Contract length: 24 monthsJob Types: Full-time, ContractSalary: $69.25-$89.75 per hourWork remotely:Temporarily due to COVID-19", "collectDate": "2020-08-19T13:47:24.000Z"}, {"jobID": "107f5c15972d617b", "jobTitle": "Solution Architect", "employer": "ThoughtWire", "location": "Toronto, ON", "url": "https://ca.indeed.com/rc/clk?jk=107f5c15972d617b&fccid=f8c195f89679dadc&vjs=3", "jobDescription": "ThoughtWire’s smart building and smart hospital software solutions empower it’s clients in commercial real estate and healthcare to optimize building operations and improve occupant experience by orchestrating data from people, processes, and the connected building in a smart digital asset - the Built Environment Digital Twin.\n\n\nThoughtWire’s innovative applications that are deployed in the cloud and on-premise, are all powered by ThoughtWire’s Built Environment Digital Twin, which breaks down silos of data to deliver the right information to the right people in context so they can take action. Whether it’s creating a seamless experience for officer workers inside a building or streamlining clinical operations, ThoughtWire is determined to make built environments healthier, safer, and more efficient places to live, work and play.\nWho we’re looking for\n\n\nThoughtWire is looking for a motivated and talented Solution Architect that is technically savvy and business focused. They are ideally highly collaborative, and have a passion for technology at their core, and are looking to see that technology achieve real outcomes in new environments. The Solution Architect will collaborate with the Senior Solution and Data Architect on the multi-disciplinary Technical Services Group (TSG) team. The TSG team is focused on implementing and delivering ThoughtWire solutions directly to our clients.\n\n\nWhat you'll be doing\n\n\nLeverage ThoughtWire technology and architect integrated solutions to meet or exceed customer needs\nWork collaboratively with customer staff and internal ThoughtWire resources to deliver exceptional customer value\nParticipate in client/partner workshops to capture functional and non-functional requirements and translate into design in collaboration with the ThoughtWire team\nClearly communicate to team members and contribute technical designs to the following artifacts: Solution Design Document, Functional Requirements, Sales Proposal Documents and User Stories\nPublish and present designs to technical, business and executive audiences\nLead Project Technical Discovery exercises\nSuccessfully engage in multiple projects and initiatives simultaneously\nEstablish and maintain solution architecture standards, providing direction to project teams and partners on best practices for ThoughtWire technology\nWork closely with the development team to ensure the functional specifications are met, platform security is accounted for, and to develop, review and evaluate designs\nAct as the liaison among client stakeholders to support the successful delivery of ThoughtWire enabled applications\nCommunicate with other Solution Architects and Delivery Consultants to understand interdependency of all ongoing projects\nDocument reference architectures and models for ThoughtWire based integration\nGovern the delivery elements for the integrated solution to ensure fit to design\n\n\nWhat you’ll need\n\n\n5+ years practical experience in information systems (Software engineering, computer science or a related technical degree)\nDeep understanding and practical experience in enterprise system and data integration\nStrong knowledge in principles of software architecture, SOA and data modeling\nImpeccable verbal and written communication skills\nProven ability to:\nArchitect scalable, secure and lasting business solutions\nDesign and deliver web based and mobile solutions\nArchitect patterns for legacy integration\nResearch and present findings and solution recommendations to customers, peers and senior management\n\n\nExperience in any of these will make you stand out\n\n\nRESTful implementation experience and messaging standards (REST, WS-*, JSON, SOAP, XML, JDBC, AMPQ)\nCloud Solution Experience (Azure, AWS, Google)\nHealthcare interoperability (HL7, XDS)\nMobile device solutions (iOS, Android)\nEnterprise security (IPSec, SSL/TLS, firewalls, certificates, key management)\nSemantic standards (RDF, OWL, SPARQL)\nUser identity and Single Sign On (Forgerock SSO, SAMLv2, oAuth, AD, LDAP)\nWeb standards (JavaScript, HTML, CSS, HTTP/HTTPS, JSP)\nProven experience with deployment and configuration of J2EE container applications such as Tomcat, IBM WebSphere or JBoss on various enterprise OS (AIX, Solaris, Windows, Linux, etc.)\n\n\nWhy you want to work for us\n\n\nGreat colleagues, mentorship, and meaningful socially impactful work\nFull benefits package from your start date - no waiting period!\nCompetitive salary\nFlexible hours\nGreat office location in Toronto’s Market District; near St. Lawrence Market\nShort walk to Union Station or King Station; steps from the King streetcar\nHealthy snacks and free drinks\n\n\nThoughtWire is an open and inclusive environment that values diversity and invests in the skills and growth of all our team members. We are non-traditional career path friendly, valuing the individual and their skills over the credentials they carry. ThoughtWire welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.", "collectDate": "2020-08-19T13:47:25.000Z"}]