[{"jobID": "f4e01ae28b091216", "jobTitle": "SmartMeter Data Analyst", "employer": "Nova Scotia Power Inc.", "location": "Halifax, NS", "url": "https://ca.indeed.com/rc/clk?jk=f4e01ae28b091216&fccid=2282f20565edc684&vjs=3", "jobDescription": "Department: Informtation Technology\nLocation: Halifax, NS\n\nType of Employment: Regular, Full Time\nDate Posted: 18th August, 2020\nNova Scotia Power's greatest source of energy is our people. In a culture focused on safety and our customers, we are committed to providing exceptional electricity service to Nova Scotians and rewarding careers for our employees. We are hiring solution-minded people excited to help us grow into the future. Therefore, we are currently looking to fill the position of Smart Meter Data Analyst to join us in supporting NSPs Advanced Metering Infrastructure (AMI) solution.\nAdvanced Metering Infrastructure (AMI) is a secure communication network system that involves advanced communication technology and meters. The meters used in AMI systems are commonly referred to as \"smart meters\" as they allow for remote two-way communication capability which enables a wide variety of benefits including operational efficiencies that translate into customer savings.\nAs a member of the Smart Meter Operations Centre (SMOC) Team you will join a dynamic group of responsive professionals responsible for performing the tasks required to maintain a high-performance network communications infrastructure.\nAccountabilities:\nThe Smart Meter Data Analyst is responsible for the day-to-day monitoring of the Meter Data Management system to ensure synchronization exists between the MDM, the CIS and the AMI head-end. Analysis, reporting, and exception handling are a primary focus of the Smart Meter Data Analyst.\n\nSupport overall implementation of AMI metering functionality and establish AMI performance indicators.\nSupport AMI metering functions, including maintenance of billing data and associated software applications as well as responding to ad hoc requests related to technical meter and meter data needs.\nSupport the business functions enabled by AMI data, resolving issues, performing complex meter data analysis, fix missing or corrupted data, and ensuring data is generally prepared and available as needed.\nRun performance reports, update dashboards, and distribute to applicable interested parties/departments.\nProvide analysis, trends, and relationships in data that support existing, emerging, and new business opportunities\nParticipate in testing of new patches or versions of MDM and related software\nMonitor daily synchronization between CIS, AMI headend and MDM\nAssist with implementation and testing, of required CIS software/process changes for Billing, Metering, and Customer Service\nDevelop documentation and maintenance of processes and procedures\nDevelop, configure, and test MDM reports and applicable rules engine\nGenerate work requests to other workgroups for work to be performed in servicing customers for such actions as re-reads, stopped meters, reading correction, field investigation of stale meters, investigation of data gaps\n\n\nYou will be responsible for your personal safety and that of your co-workers by observing all Occupational Health and Safety Rules and Regulations. You will be accountable for environmental performance as it relates to the environmental management system processes and initiatives.\nSkills, Capabilities and Experience:\n\nMinimum completion of a 4-year post-secondary degree in business informatics, computer science, Business Administration, or other related field.\nMinimum of three years' relevant experience with metering and billing functions and a strong understanding of utility billing practices\nPrevious experience with data modeling or analysis in database systems.\nCapacity to work and communicate with a range of stakeholders.\nSuperior written and verbal communication skills; ability to clearly communicate complex technical concepts.\nAbility to work effectively as part of a small team in a fast-paced, rapidly changing environment.\nAbility to travel and work flexible hours, as necessary.\n\n\nTechnical skills:\n\nCompetency using MS Office Outlook, Word, Excel.\nCompetency developing complex databases and reports using data visualization tools such as Tableau\nThe ideal candidate will have an understanding of Metering Standards and also be familiar with quality assurance programs.\nKnowledge of data processing standards and Measurement Canada requirements would be a definite asset.\n\nThe successful candidate must be willing to complete a Criminal Background Check.\nAt Nova Scotia Power, our employees are our greatest strength. Our Leadership Competencies set standards that advance our business strategy, deliver results for customers, and provide career development for employees. As the ideal candidate for this position you speak up on health, safety and environment issues, and demonstrate a belief that all injuries are preventable. You support flexibility in the workplace and embrace change. A Business Analyst builds strong collaborative relationships with a commitment to a respectful, inclusive and productive work environment while demonstrating integrity and a commitment to operational excellence for our customers. Lastly, we encourage you to proactively ask questions and seek information to understand how your work relates to the business goals and make well informed decisions.\nReports To: Meter Lead, AMI\nForm of Application: Click the APPLY button at the end of the online job posting. Complete all required information fields, and copy and paste your covering letter and resume into the online form.\n\nSalary: Commensurate with qualifications and experience.\n\nMust Be Received By: All interested candidates should apply no later than September 2nd, 2020. Late applications may not receive consideration.\nRecruitment and Promotion Policy: When filling vacant positions, we are determined to hire the best candidates available. We're committed to providing employees with a fair and equal opportunity to compete for jobs. Hiring and promotion of employees is based on skills, capabilities, knowledge and demonstrated abilities.\nWe value diversity in the workplace and strongly encourage applications from all qualified candidates including African Nova Scotians and other members of the visible minority community, Aboriginal peoples, persons with disabilities, and women in non-traditional roles.\n\nNormally, unless otherwise requested in advance, the supervisors of internal candidates selected for an interview will be contacted in order to facilitate scheduling of the interviews. The supervisor will maintain the confidentiality of the employee's application.", "collectDate": "2020-08-19T13:52:07.000Z"}, {"jobID": "316bfd5d759393bf", "jobTitle": "Research Assistant/Data Analyst position in a neuroimaging lab.", "employer": "Dalhousie University", "location": "Halifax, NS", "url": "https://ca.indeed.com/company/Dalhousie-University/jobs/Research-Assistant-Data-Analyst-Position-Neuroimaging-Lab-316bfd5d759393bf?fccid=9986a6606e2479c3&vjs=3", "jobDescription": "We are looking for a Research Assistant/Data Analyst to join our lab on a full-time basis.Applications are invited for a fully-funded position at the rank of research assistant to join the Brain Networks and Neurophysiology (NetPhys) Lab. Salary will be commensurate with experience. The starting date is as early as September 2020 (negotiable).This is a unique opportunity to understand the neurophysiologic basis of brain function and to build transferable skills such as use of multimodal brain imaging, machine learning, dynamic connectivity and graph theory-based network analysis.Statistical, computational and signal processing skills are required for this research: ability to write code and/or to modify existing analysis code.Setting up and testing biomedical equipmentSkills for interacting with human subjects and data collection.Strong writing capability with evidence in the form of a publication.Submit a cover letter and current CV (including a list of scholarly publications), along with the names and contact information for three referees asap to Javeria.Hashmi at the rate of dal.caRequirements: The successful candidate will be well organized, a strong team player, a solid work ethic and will be able to handle multiple tasks simultaneously. A Neuroscience degree with experience in coding with Matlab/Python or experience related to the job description will be preferred. Electrical engineering, physics and data scientists will also be considered.Contact us asap. Send in a CV and names of three references.About Us: The successful candidate will become a member of the Brain Networks and Neurophysiology lab in the Department of Anesthesia, Pain Management and Perioperative Medicine. Our lab uses behavioral tests and brain imaging to study pain mechanisms and cognition in humans. We study healthy subjects and people suffering with chronic pain. The lab is located in the Pain Management Unit and in BIOTIC in NSHA, Halifax.See netphyslab.com for details.Expected start date: 2020-09-15Job Type: Full-timeSalary: $18.00-$22.00 per hourBenefits:Dental CarePaid Time OffVision CareSchedule:8 Hour ShiftCOVID-19 considerations:Our lab works regular hours on Slack. However, equipment testing and data analysis does require on-site attendance.Work remotely:No", "collectDate": "2020-08-19T13:52:08.000Z"}]