[{"jobID": "4d25903140b8e234", "jobTitle": "Cloud Infrastructure Engineer - Microsoft", "employer": "SADA", "location": "Toronto, ON", "url": "https://ca.indeed.com/rc/clk?jk=4d25903140b8e234&fccid=b704562e07a2a03f&vjs=3", "jobDescription": "Join SADA as a Cloud Infrastructure Engineer!\n\nYour Mission\n\nAs a Cloud Infrastructure Engineer at SADA, you will work collaboratively to deliver high-quality infrastructure projects on Google Cloud Platform, with an emphasis on solutions involving Microsoft technologies. You will have an opportunity to work on real-world problems facing our customers in the field. Engagements vary from being purely consultative to requiring heavy hands-on work, and cover a range of domain areas, such as workload migrations from on-prem or other clouds to GCP, standing up experimental infrastructures on GCP, building hybrid-cloud solutions on top of Kubernetes and Anthos, implementing Infrastructure-as-code environment automation, and developing fully automated CI/CD pipelines. Moreover, you will have the opportunity to provide thought leadership, delivering best practice recommendations internally and externally.\n\nYou possess a diverse background in areas such as architecture design, distributed systems, infrastructure migration, and deployment strategies. To be successful, one must know how to navigate ambiguity, have extensive experience working with cloud technologies, have technical depth, and enjoy working with customers.\n\nYou will be recognized as an established contributor by your team. You will contribute design and implementation components for multiple projects. You will work mostly independently with limited oversight. You will also participate in client-facing discussions in areas of expertise.\n\nPathway to Success\n\n#MakeThemRave is at the foundation of every project our engineering teams take on. Our singular goal is to provide customers with the best possible experience in migrating, building, modernizing, and operationalizing their systems in Google Cloud Platform.\n\nYour success starts by positively impacting the direction of a dynamic practice with vision and passion. You will be measured quarterly by the breadth, magnitude, and quality of your contributions, your ability to estimate accurately, customer feedback at the close of projects, how well you collaborate with your peers, and the consultative polish you bring to customer interactions.\n\nAs you continue to execute successfully, we will build a customized development plan together that leads you through the engineering or management growth tracks.\n\nExpectations\n\nRequired Travel - 20% travel to customer sites, conferences, and other related events. Due to the COVID-19 pandemic, travel has been temporarily restricted.\n\nCustomer Facing - You will interact with customers on a regular basis, sometimes daily, other times weekly/bi-weekly. Common touchpoints occur when qualifying potential opportunities, at project kickoff, throughout the engagement as progress is communicated, and at project close. You can expect to interact with a range of customer stakeholders, including engineers, technical project managers, and executives.\n\nTraining - ongoing with first-week orientation at HQ followed by a 90-day onboarding schedule. Details of the timeline can be shared.\n\nJob Requirements\n\nRequired Credentials:\n\nGoogle Cloud Architect Certified or able to complete within the first 45 days of employment.\n\nRequired Qualifications:\n\nExperience with Microsoft Windows Server, including Microsoft Active Directory Domain Services (Forests, Domains and Trusts), Windows Server 2012 R2 and above (Windows Server Services, Event Logging, Networking, Firewalls, and Registry), and architecting/developing/and maintaining production-grade systems in virtualized environments.\n\nExperience with Microsoft Windows and Windows Server 2012 R2 and above\nExperience with Microsoft Active Directory Domain Services\nExperience with Microsoft Windows PowerShell\nExperience with NTFS volume management\nExperience with networking, VPNs, compute infrastructure (servers, databases, firewalls, load balancers)\nKnowledge of systems monitoring, capacity planning, and performance tuning\n\nUseful Qualifications:\n\nExperience with Microsoft SQL Server Enterprise replication architectures using AlwaysOn Availability Groups\nExperience with Microsoft SQL Server Standard transactional replication architectures\nKnowledge of Microsoft SQL monitoring, failover, and load testing\nExperience with Windows Server Failover Cluster Instances (FCI)\nExperience with Windows Server Storage Spaces Direct (S2D)\nExperience with Windows Server IIS and load balancing\nExperience delivering immutable Infrastructure-as-Code solutions using tools like Terraform, Ansible, Chef, Puppet, Salt, and Packer\nExperience migrating complex, multi-tiered workloads from on-prem to the cloud, including provisioning the target infrastructure and executing cutover plans that minimize system downtime.\nExperience delivering continuous integration/continuous delivery pipelines, utilizing techniques like blue/green and canary deployments, with tools such as Jenkins, CircleCI, TravisCI, and Spinnaker.\n\nAbout SADA\n\nValues: We built our core values on themes that internally compel us to deliver our best to our partners, our customers and to each other. Ensuring a diverse and inclusive workplace where we learn from each other is core to SADA's values. We welcome people of different backgrounds, experiences, abilities, and perspectives. We are an equal opportunity employer.\n\nMake them rave\nBe data-driven\nBe one step ahead\nBe a change agent\nDo the right thing\n\nWork with the best: SADA has been the largest partner in North America for GCP since 2016 and has been named the 2019 and 2018 Google Cloud Global Partner of the Year. SADA has also been awarded Best Place to Work by Inc. as well as LA Business Journal!\n\nBenefits: Unlimited PTO, competitive and attractive compensation, performance-based bonuses, paid holidays, rich medical, dental, vision plans, life, short and long-term disability insurance, 401K with match, professional development reimbursement program as well as Google Certified training programs.\n\nBusiness Performance: SADA has been named to the INC 5000 Fastest-Growing Private Companies list for 12 years in a row garnering Honoree status. CRN has also named SADA on the Top 500 Global Solutions Providers for the past 5 years. The overall culture continues to evolve with engineering at its core: 3200+ projects completed, 3000+ customers served, 10K+ workloads and 25M+ users migrated to the cloud.", "collectDate": "2020-08-19T13:47:02.000Z"}]