[{"jobID": "912fae99ee9c9849", "jobTitle": "Senior Statistical Data Analyst", "employer": "York Region", "location": "Vaughan, ON", "url": "https://ca.indeed.com/rc/clk?jk=912fae99ee9c9849&fccid=f3c54a468b13c9c9&vjs=3", "jobDescription": "", "collectDate": "2020-08-18T23:03:06.000Z", "source": "Indeed"}, {"jobID": "98821e8d6ccca490", "jobTitle": "Data Analyst - 4 month Co-op", "employer": "Flashfood", "location": "Toronto, ON", "url": "https://ca.indeed.com/rc/clk?jk=98821e8d6ccca490&fccid=87b5e795fed0c32d&vjs=3", "jobDescription": "Did you know that 30-40% of food that is produced around the world ends up in landfills?\nWho We Are:\nAt Flashfood, we are on a mission to reduce the environmental impact of food waste and affordably feed people. We are tackling this gigantic problem together, with a team that believes in authenticity, perseverance, and humility.\nOur team comes from a variety of different industries and backgrounds such as management consulting, finance, and emerging technology, however we decided it was time to do something different - something that would create a better world for future generations!\nFlashfood is looking for a dynamic person to join our Data team and help drive growth, understanding, and success.\nFlashfood is an innovative solution designed to help grocers sell surplus food nearing expiry, capturing sales and successfully diverting food from landfills. This creates financial benefits for its partners, reduces the negative environmental impacts of food waste and helps to feed people affordably.\nWho You Are:\nYou are comfortable working in an evolving technology infrastructure to help us make data-informed decisions. You will be scrappy, independent, and excited about making a big impact and helping to solve hard problems.\n\nAs part of the Data team, you will partner closely with Finance, Operations, Marketing, Engineering & Product to provide visibility into our data, craft narratives, find insights, and provide recommendations. Data works closely with Engineering to transform data into products and insights that allow the rest of the company to make better decisions faster.\nWhat You Will Do:\nDeepen your understanding of patterns/trends in user behaviour, design experiments, and uncover new opportunities\nBuild dashboards and reports to drive awareness and understanding of metrics and experiment results\nUse data to inform and influence the direction of team roadmaps and support business decisions\nWork with key stakeholders to define goals and identify metrics for improving existing features and new releases\n\nWhat You Will Need:\nExperience doing quantitative analysis\nThe ability to use analysis to impact key business or product decisions\nThe ability to clearly and effectively communicate the results of complex analyses\nA basic understanding of SQL, programming, and BI tools (e.g. Tableau, Power BI)\nA basic understanding of statistical applications and methods (experimentation, probabilities, regression)\nKnowledge of software engineering, data engineering, consulting, or academic research a plus\n\nNice To Have:\nStrong technical abilities including SQL, OLE/DB, and advanced Microsoft Excel\nAble to adapt quickly and execute effectively based on dynamic changing business and technical requirements\nExperience in inventory management and operations settings, including dealing with big data, is a plus\nExperience in scripting and additional programming in a professional environment is a plus\nFamiliarity with AWS or other cloud technologies is a plus\n\nFlashfood is an equal opportunity employer and is committed to providing an accessible recruitment process. Please advise should you need any accommodation throughout the recruitment process. All your information will be treated confidentially.", "collectDate": "2020-08-18T23:03:08.000Z", "source": "Indeed"}, {"jobID": "df324eac7eeee90b", "jobTitle": "New Grad Rotational Program - Rotational Analyst (Operations Delivery Management)", "employer": "Mackenzie Financial Corporation", "location": "Toronto, ON", "url": "https://ca.indeed.com/rc/clk?jk=df324eac7eeee90b&fccid=2761029774975db0&vjs=3", "jobDescription": "Job Description:\n\nIGM Financial Inc. is one of Canada's premier financial services companies, and one of the country's largest managers and distributors of investment funds and other managed asset products, with over $170.4 billion in total assets under management as of July 31, 2020. Its activities are carried out principally through Investors Group Inc., Mackenzie Financial Corporation and Investment Planning Counsel Inc.\n\nWe are focused on the long-term strength and stability of our companies and recognize these as core responsibilities to our clients and shareholders as we adapt and lead in an ever-changing world.\n\nWhy should you join the IGM family?\nBe part of a winning culture!\nYour opportunity to develop and work with smart, highly capable leaders who are passionate and innovative\nA genuine commitment to diversity and inclusion, through public goals, a variety of external partnerships/employee groups and an inclusive environment\nA fulfilling employee experience – we offer competitive terms, a collaborative/respectful way of working and connect strongly with our community\nNew Grad Rotational Program – Operations Delievery Management\nWe are currently hiring students in their final year of study looking for opportunities after graduation. The New Grad Rotational Program offers students the opportunity to complete four rotations over a two-year period with the opportunity to be placed full time after completion. The participants will develop a strong understanding of the business’ big picture and how each department contributes to the success of the organization.\n\nWith placements available in our Toronto Mackenzie Investments office, the Operations Delivery Management stream will provide hands on exposure to important projects, contributing real gains to the company. Within a supportive and collaborative environment, participants are given the autonomy and responsibility to manage their projects and deliver results to senior member of the team. If you have a strong interest in the financial industry and enjoy solving programs this opportunity is for you. In addition, the program will provide training to develop leadership skills and the opportunity to build a network across the organization. The program provides a mentorship component with continuous feedback and coaching.\n\nGroup rotations within the New Grad Rotational Operations Delivery Management stream will be within Business Architecture, Technology Delivery, Business / Project Management and Data Analyst.\n\nThe responsibilities will vary depending on the department needs; however, will include the following:\nContributing to various project initiatives that support our business strategies\nResearching, analyzing, preparing reports and presenting findings to senior management\nNetworking and seeking feedback\nAnalyzing business processes to identify opportunities for improvement\nThe following requirements will assist the successful candidates:\nGraduating in April 2021 in a related field (BCom, BA, BSc, etc.)\nPassionate about a career in the Financial Industry\nDemonstrated initiative and leadership skills\nWell-developed written and oral communication with strong presentation skills\nCreativity and innovation with the ability to meet changing deadlines\nAbility to work well in a team environment\nExcellent interpersonal, judgment & decision-making skills\nAbility to self-motivate and prioritize time-sensitive deadlines\n\nTo apply, please include a cover letter, resume and transcripts (full unofficial version) by September 21st at 11:59pm EST.\n\nPlease visit our Student Career page by clicking on the following link:\nhttps://www.mackenzieinvestments.com/en/about/careers/student-new-graduate-career\n\nWe thank all applicants for their interest in Mackenzie Investments; however only those candidates selected for an interview will be contacted.\nMackenzie Investments is an equal opportunity employer and is committed to providing employment accommodations in accordance with the Ontario Human Rights Code and the Accessibility of Ontarians with Disabilities Act. Please advise Human Resources if you require an accommodation.\n\nFile# 00-20-16", "collectDate": "2020-08-18T23:03:09.000Z", "source": "Indeed"}, {"jobID": "d6b399e4625c75ab", "jobTitle": "Data Analyst (Coder) - Decision Support - Temporary Full Time (201858)", "employer": "Sunnybrook Health Sciences Centre", "location": "Toronto, ON", "url": "https://ca.indeed.com/rc/clk?jk=d6b399e4625c75ab&fccid=2d88a9c34448e1e0&vjs=3", "jobDescription": "We currently have a Temporary Full Time opportunity for a Data Analyst (Coder) in the Decision Support Department at our Bayview Campus.\nSummary of Duties\nPerform quality control processes on Activity Level Reporting (ALR) data to ensure quality and integrity of data submitted to Health Ontario (CCO)\nPerform mandatory data submission to various databases such as ALR, Neuroendocrine, Sarcoma, etc.\nDevelopment and deployment of ad-hoc and standard reports to support Odette Operational needs using a variety of reporting tools such as SQL, SAP Crystal Reports, SAS, PowerBI, etc.\nProvide system/user support for Oncology applications such as Excelicare, CHARM, Mirror and OPIS\nConduct user training workshops for Oncology applications such as CHARM, eSheet and OPIS\nParticipating in testing of software applications as a result of system upgrades, software fixes and enhancements.\nOther duties as assigned by the management team\n\nQualifications/Skills\nUndergraduate Degree from a Health Sciences Program\nStrong communication and interpersonal skills\nStrong technical and analytical aptitude\nAbility to problem solve\nAble to organize, plan and prioritize work with time constraints and strict deadlines\nMinimum of two (2) years experience in a health care setting required.\nProven ability to develop and generate statistical/business reports using SQL, SAP Crystal Reports, PowerBI\nEstablished proficiency in computer software applications (e.g. MSOffice, Visio and MS Projects)\n\nQualified candidates are invited to submit their cover letter and resume (in one document) quoting 201858 to:\nHuman Resources\nSunnybrook Health Sciences Centre\n\nSunnybrook Health Sciences Centre is committed to providing accessible employment practices that are in compliance with the Accessibility for Ontarians with Disabilities Act (AODA). If you require accommodation for disability during any stage of the recruitment process, please indicate this in your cover letter.\nSunnybrook Health Sciences Centre is strongly committed to inclusion and diversity within its community and welcomes all applicants including but not limited to: visible minorities, all religions and ethnicities, persons with disabilities, LGBTQ persons, and all others who may contribute to the further diversification of ideas.", "collectDate": "2020-08-18T23:03:09.000Z", "source": "Indeed"}, {"jobID": "4eb4741a4de3833d", "jobTitle": "Data Analyst", "employer": "Geotab", "location": "Oakville, ON", "url": "https://ca.indeed.com/rc/clk?jk=4eb4741a4de3833d&fccid=31921a4bf53a6026&vjs=3", "jobDescription": "Who is Geotab:\n\nGeotab, a global leader in IoT and connected transportation, is one of the fastest-growing technology companies in North America and a certified “Great Place to Work.” Each day, Geotab processes billions of data points from over 2 million connected vehicles, extracting actionable insights to help empower businesses to better manage their fleets. Recognized as the world’s #1 commercial telematics provider, Geotab’s solutions are used by more than 40,000 customers in over 130 countries around the globe. Geotab understands that telematics is critical to helping create safer and more sustainable drivers, businesses and communities and actively works to help businesses improve driver behavior, reduce greenhouse gas emissions and create safer roads for all. Global demand for telematics is increasing and Geotab is leading the way. Are you ready to join us? To see what it’s like to be a Geotabber, follow us @InsideGeotab on Instagram, Twitter or Facebook today!\n\nWho we are looking for:\n\nWe are looking for Data Analysts who can help us discover value out of our rich and large datasets. Our ideal team member will have the mathematical and statistical expertise you’d expect, but a natural curiosity and creative mind that’s not so easy to find. As you mine, interpret and clean our data, we will rely on you to ask questions, connect the dots and uncover opportunities that lie hidden within, all with the ultimate goal of realizing the data’s full potential. You will join a team of data specialists, but will “slice and dice” data using your own methods, creating new visions for the future. If you are a Data Analyst who knows how to extract meaning from and interpret data - we would like to hear from you!\n\nWhat are the details of this position:\n\nAs a Data Analyst you will be a crucial part of producing innovative analytics from Geotab’s big data environment. Geotab’s systems process over 40 billion data records per day from over 2 million vehicles in 100+ countries across the globe. We believe that there is collective value in the massive amount of data arising from all of our sensors across the globe. And most importantly, we believe this data can be used to improve safety, infrastructure, and productivity for our customers. You will work with our team of data scientists and engineers who have curated our data repository and have created a series of near real-time and historical datasets categorized under Weather, Urban Infrastructure and Location Analytics. You will produce insights for our partners and customers to directly benefit from the analysis and develop customer-facing products from these results. You will work closely with Data Scientists, Data Engineers, Professional Services, Data Privacy & Governance, firmware as well as all the other internal departments such as Software Development and Solutions Engineering to achieve these objectives.\n\nOur Technology Stack :\n\nWe leverage the Google Cloud Platform (GCP) as our big-data environment. Most of our development work happens in Python, leveraging various big data and data science tools in GCP (e.g. Dataflow) as well as from the open-source community (e.g. JupyterLab).\n\nSQL\nPython Modules : numpy, scipy, theano, keras, pytorch, pandas, matplotlib, xgboost, scikit-learn, nltk, seaborn, networkx, osmnx\nBig Data Tools : JupyterLab, TensorFlow, Apache Spark , Beam, Dataflow, Airflow\nGoogle BigQuery, Kafka, Kubernetes\nDuties and Tasks/Essential Functions:\nInteract with Geotab’s Big Data Infrastructure on Google Bigquery using Python and SQL\nProcess, cleanse, and verify the integrity of data used for analysis\nExamine large data sets to identify trends, develop charts, and create visual presentations to help businesses make more strategic decisions\nUtilize statistical tools to interpret data sets and prepare reports that effectively communicate trends, patterns, and predictions based on relevant findings\nWrite SQL queries to find answers to complex business questions\nIdentify any data quality issues and partialities in data acquisition\nCoordinate with the engineering team to gather incremental new data\nUse data mining, model building, and other analytical techniques to support internal initiatives\nAssist the internal technical departments by providing meaningful insight using datasets\nWork with data scientists and leverage machine learning models that have been developed against Geotab’s big data environment.\nExperience/Skills Required:\nGraduate or Postgraduate Degree in Computer Science, Electrical, or Software Engineering, Mathematics, Statistics or a related field\n3-5 years experience as a Data Analyst with proven proficiency in SQL is required\nExposure to data science tools such as Python, Pandas and NumPy is nice to have\nExperience working with big data and an understanding of techniques used to extract value out of very large datasets is essential\nExperience with database design and writing queries is key to be successful in this role\nFamiliarity with machine learning concepts and tools such as Scikit-learn and Tensorflow is an asset\nExperience working with Google Compute Engine and Google Bigquery is nice to have\nA keen interest to make a positive impact in the community that we live in by developing data driven smart city insights and urban analytics\nWhat makes our staff passionate about Geotab?\n\nTable Tennis at the office - bring your own bat!\nGreat accommodation (brand new office building, height-adjustable desks)\nLight breakfast served daily\nHot lunches or fresh sandwiches served every Friday\nGeotab-sponsored sports teams and social events\nFull medical benefits and 4% company matching RSP (full-time employees only)\n\nOur Core Values:\n\nGeotab is shaping the future of telematics. Using leading technology, we embrace change and challenge the status quo. To stay ahead of the curve, we keep Geotabbers energized with data bootcamps, course subsidies, Friday lunches, and more. We believe collaboration leads to innovation; our teams stretch across floors, cities and continents. All employees, from the CEO to the summer students, maintain an open-door policy. Whether we’re fine-tuning our products, or boosting our office culture, we’re building a foundation for long-term success. To us, this means safer roads, more efficient fleets and a team of dynamic Geotabbers!\n\nGeotab encourages applications from all qualified candidates. Geotab is committed to accommodating persons with disabilities throughout the interview, selection and employment process. If you require accommodation at any stage of the application process or want more information about our accommodation policies and practices, please contact us at (416) - 434 4309.", "collectDate": "2020-08-18T23:03:10.000Z", "source": "Indeed"}, {"jobID": "1e990b2ab9a8c476", "jobTitle": "Technical Recruiter", "employer": "Localcoin", "location": "Toronto, ON", "url": "https://ca.indeed.com/rc/clk?jk=1e990b2ab9a8c476&fccid=890da6efe7e4a890&vjs=3", "jobDescription": "About the role\nLocalcoin seeks to inspire the future of digital currency globally as the largest cryptocurrency kiosk network in Canada.\nWe are looking for a Technical Recruiter to join our talent team for a 5-month contact to engage and build relationships with world class talent. Reporting directly to the Internal Operations Director and working closely with all other members of the recruitment and leadership team you are responsible for providing an unparalleled candidate experience, while leading strategic hiring discussions to build teams holistically.\nThis role has the opportunity to move into a full time position at the end of the contract\nWhat you'll do\nHire across all levels for a variety of technical roles (Data Analyst, Integrations Engineer, Financial Analyst etc.)\nBuild relationships and collaborate with hiring managers to understand hiring needs and team goals\nManage the full cycle recruitment process, ensuring an unparalleled positive candidate experience\nPartner with the recruiting team to build efficient and scalable technical recruiting processes\nSource active and passive candidates from a variety of sources and communities: online databases, events, networking and research\nLead strategic discussions to build teams holistically\nWho you are\nHas 3+ years of technical sourcing/recruitment experience (engineering and finance roles)\nCan build meaningful relationships with hiring leaders and candidates\nHas experience in a dynamic hyper growth start-up environment\nHas a genuine passion for learning about what drives people in their career\nHas a love of all things data and uses data to drive decision making\nExperience building and improving technical recruitment processes\nIs self-motivated and a lifelong learner\n\n\nYou'll have full access all our perks\n\nHealth & Wellness Benefits - We offer a comprehensive benefits package to all full time empo that covers up to 100% of traditional benefits such as dental, prescription drug coverage, critical illness, life and AD&D. The plan also includes 100% coverage of unlimited travel insurance, on-demand online nurse assessments through Akira app. We offer a monthly spend on non-traditional medical expenses (massages, chiropractic) and a wellness account (gym memberships, spa, nutritionist).\n\nLocation - Currently we are working from home during COVID-19 pandemic, likely until the end of 2020. When we return to our downtown office we are close to Union Station and near major highways. We also have a flexible work schedule to help you avoid rush hour and work from options!\n\nProfessional Development - We'll invest in your career. Our company is growing quickly, and we'll give you the opportunity to do the same. You'll have access to a number of professional development opportunities so that you can keep up with the company's evolving needs and grow your career along the way.\n\nCompensation - We offer competitive compensation packages. We deeply value the talent and impact our team brings to the table, and believe that fair and equitable total compensation packages are part of our commitment to everyone who works here.\n\nPurchase Cryptocurrency At Market Rate - You'll be able to purchase and sell cryptocurrencies supported by Localcoin at the Canadian market rate with zero fees. You'll also gain exclusive coupons for all of our Bitcoin Kiosks nationwide!\n\nGet Involved - Attend company-wide teach and training days, industry events, biweekly virtual team gatherings.\n\nSound like something you want to be part of? We're hiring, apply today!", "collectDate": "2020-08-18T23:03:11.000Z", "source": "Indeed"}]